<?php

namespace app\controllers;

use Yii;
use yii\web\Controller;
use app\components\Scating;

class ScatingController extends \yii\web\Controller
{
	public $defaultAction = 'index';

	public function actionIndex()
	{
	 $JudicialPlaces=[1=>//танец
 				[11=>//пара
 					[3,3,3,2,3],//судьи
 				2=>
 					[6,6,6,6,5],
 				3=>
 					[2,2,5,4,1],
 				4=>
 					[4,4,2,3,4],
 				5=>
 					[1,5,1,1,2],
 				6=>
 					[5,1,4,5,6],
 				],
 			2=>//танец
 				[11=>//пара
 					[1,5,1,1,2],//судьи
 				2=>
 					[2,2,5,4,1],
 				3=>
 					[3,3,3,2,3],
 				4=>
 					[4,4,2,3,4],
 				5=>
 					[5,1,4,5,5],
 				6=>
 					[6,6,6,6,6],
 				],
 			3=>//танец
 				[11=>//пара
 					[1,1,1,4,4],//судьи
 				2=>
 					[3,2,2,1,1],
 				3=>
 					[2,5,5,2,2],
 				4=>
 					[4,3,4,5,3],
 				5=>
 					[5,4,3,3,5],
 				6=>
 					[6,6,6,6,6],
 				],
 			4=>//танец
 				[11=>//пара
 					[1,1,1,4,4],//судьи
 				2=>
 					[3,2,2,1,1],
 				3=>
 					[2,5,5,2,2],
 				4=>
 					[4,3,4,5,3],
 				5=>
 					[5,4,3,3,5],
 				6=>
 					[6,6,6,6,6],
 				],
 			5=>//танец
 				[11=>//пара
 					[1,1,1,4,4],//судьи
 				2=>
 					[3,2,2,1,1],
 				3=>
 					[2,5,5,2,2],
 				4=>
 					[4,3,4,5,3],
 				5=>
 					[5,4,3,3,5],
 				6=>
 					[6,6,6,6,6],
 				],

 			];
			
		$scating = new Scating($JudicialPlaces);//расчет мест			
		return $this->render('about', ['message' => '<pre>' . $scating->log. '</pre>']);
}}